MikroElektronika/core_packages/ARM/gcc_clang/system/src/infineon/cy8c4148lda/thirdparty/cy8c4148lda/ip/cyip_canfd_v2.h
/* CANFD_CH_M_TTCAN.CREL */
#define CANFD_CH_M_TTCAN_CREL_DAY_Pos           0UL
#define CANFD_CH_M_TTCAN_CREL_DAY_Msk           0xFFUL
#define CANFD_CH_M_TTCAN_CREL_MON_Pos           8UL
#define CANFD_CH_M_TTCAN_CREL_MON_Msk           0xFF00UL
#define CANFD_CH_M_TTCAN_CREL_YEAR_Pos          16UL
#define CANFD_CH_M_TTCAN_CREL_YEAR_Msk          0xF0000UL
#define CANFD_CH_M_TTCAN_CREL_SUBSTEP_Pos       20UL
#define CANFD_CH_M_TTCAN_CREL_SUBSTEP_Msk       0xF00000UL
#define CANFD_CH_M_TTCAN_CREL_STEP_Pos          24UL
#define CANFD_CH_M_TTCAN_CREL_STEP_Msk          0xF000000UL
#define CANFD_CH_M_TTCAN_CREL_REL_Pos           28UL
#define CANFD_CH_M_TTCAN_CREL_REL_Msk           0xF0000000UL
/* CANFD_CH_M_TTCAN.ENDN */
#define CANFD_CH_M_TTCAN_ENDN_ETV_Pos           0UL
#define CANFD_CH_M_TTCAN_ENDN_ETV_Msk           0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.DBTP */
#define CANFD_CH_M_TTCAN_DBTP_DSJW_Pos          0UL
#define CANFD_CH_M_TTCAN_DBTP_DSJW_Msk          0xFUL
#define CANFD_CH_M_TTCAN_DBTP_DTSEG2_Pos        4UL
#define CANFD_CH_M_TTCAN_DBTP_DTSEG2_Msk        0xF0UL
#define CANFD_CH_M_TTCAN_DBTP_DTSEG1_Pos        8UL
#define CANFD_CH_M_TTCAN_DBTP_DTSEG1_Msk        0x1F00UL
#define CANFD_CH_M_TTCAN_DBTP_DBRP_Pos          16UL
#define CANFD_CH_M_TTCAN_DBTP_DBRP_Msk          0x1F0000UL
#define CANFD_CH_M_TTCAN_DBTP_TDC_Pos           23UL
#define CANFD_CH_M_TTCAN_DBTP_TDC_Msk           0x800000UL
/* CANFD_CH_M_TTCAN.TEST */
#define CANFD_CH_M_TTCAN_TEST_TAM_Pos           0UL
#define CANFD_CH_M_TTCAN_TEST_TAM_Msk           0x1UL
#define CANFD_CH_M_TTCAN_TEST_TAT_Pos           1UL
#define CANFD_CH_M_TTCAN_TEST_TAT_Msk           0x2UL
#define CANFD_CH_M_TTCAN_TEST_CAM_Pos           2UL
#define CANFD_CH_M_TTCAN_TEST_CAM_Msk           0x4UL
#define CANFD_CH_M_TTCAN_TEST_CAT_Pos           3UL
#define CANFD_CH_M_TTCAN_TEST_CAT_Msk           0x8UL
#define CANFD_CH_M_TTCAN_TEST_LBCK_Pos          4UL
#define CANFD_CH_M_TTCAN_TEST_LBCK_Msk          0x10UL
#define CANFD_CH_M_TTCAN_TEST_TX_Pos            5UL
#define CANFD_CH_M_TTCAN_TEST_TX_Msk            0x60UL
#define CANFD_CH_M_TTCAN_TEST_RX_Pos            7UL
#define CANFD_CH_M_TTCAN_TEST_RX_Msk            0x80UL
/* CANFD_CH_M_TTCAN.RWD */
#define CANFD_CH_M_TTCAN_RWD_WDC_Pos            0UL
#define CANFD_CH_M_TTCAN_RWD_WDC_Msk            0xFFUL
#define CANFD_CH_M_TTCAN_RWD_WDV_Pos            8UL
#define CANFD_CH_M_TTCAN_RWD_WDV_Msk            0xFF00UL
/* CANFD_CH_M_TTCAN.CCCR */
#define CANFD_CH_M_TTCAN_CCCR_INIT_Pos          0UL
#define CANFD_CH_M_TTCAN_CCCR_INIT_Msk          0x1UL
#define CANFD_CH_M_TTCAN_CCCR_CCE_Pos           1UL
#define CANFD_CH_M_TTCAN_CCCR_CCE_Msk           0x2UL
#define CANFD_CH_M_TTCAN_CCCR_ASM_Pos           2UL
#define CANFD_CH_M_TTCAN_CCCR_ASM_Msk           0x4UL
#define CANFD_CH_M_TTCAN_CCCR_CSA_Pos           3UL
#define CANFD_CH_M_TTCAN_CCCR_CSA_Msk           0x8UL
#define CANFD_CH_M_TTCAN_CCCR_CSR_Pos           4UL
#define CANFD_CH_M_TTCAN_CCCR_CSR_Msk           0x10UL
#define CANFD_CH_M_TTCAN_CCCR_MON__Pos          5UL
#define CANFD_CH_M_TTCAN_CCCR_MON__Msk          0x20UL
#define CANFD_CH_M_TTCAN_CCCR_DAR_Pos           6UL
#define CANFD_CH_M_TTCAN_CCCR_DAR_Msk           0x40UL
#define CANFD_CH_M_TTCAN_CCCR_TEST_Pos          7UL
#define CANFD_CH_M_TTCAN_CCCR_TEST_Msk          0x80UL
#define CANFD_CH_M_TTCAN_CCCR_FDOE_Pos          8UL
#define CANFD_CH_M_TTCAN_CCCR_FDOE_Msk          0x100UL
#define CANFD_CH_M_TTCAN_CCCR_BRSE_Pos          9UL
#define CANFD_CH_M_TTCAN_CCCR_BRSE_Msk          0x200UL
#define CANFD_CH_M_TTCAN_CCCR_PXHD_Pos          12UL
#define CANFD_CH_M_TTCAN_CCCR_PXHD_Msk          0x1000UL
#define CANFD_CH_M_TTCAN_CCCR_EFBI_Pos          13UL
#define CANFD_CH_M_TTCAN_CCCR_EFBI_Msk          0x2000UL
#define CANFD_CH_M_TTCAN_CCCR_TXP_Pos           14UL
#define CANFD_CH_M_TTCAN_CCCR_TXP_Msk           0x4000UL
#define CANFD_CH_M_TTCAN_CCCR_NISO_Pos          15UL
#define CANFD_CH_M_TTCAN_CCCR_NISO_Msk          0x8000UL
/* CANFD_CH_M_TTCAN.NBTP */
#define CANFD_CH_M_TTCAN_NBTP_NTSEG2_Pos        0UL
#define CANFD_CH_M_TTCAN_NBTP_NTSEG2_Msk        0x7FUL
#define CANFD_CH_M_TTCAN_NBTP_NTSEG1_Pos        8UL
#define CANFD_CH_M_TTCAN_NBTP_NTSEG1_Msk        0xFF00UL
#define CANFD_CH_M_TTCAN_NBTP_NBRP_Pos          16UL
#define CANFD_CH_M_TTCAN_NBTP_NBRP_Msk          0x1FF0000UL
#define CANFD_CH_M_TTCAN_NBTP_NSJW_Pos          25UL
#define CANFD_CH_M_TTCAN_NBTP_NSJW_Msk          0xFE000000UL
/* CANFD_CH_M_TTCAN.TSCC */
#define CANFD_CH_M_TTCAN_TSCC_TSS_Pos           0UL
#define CANFD_CH_M_TTCAN_TSCC_TSS_Msk           0x3UL
#define CANFD_CH_M_TTCAN_TSCC_TCP_Pos           16UL
#define CANFD_CH_M_TTCAN_TSCC_TCP_Msk           0xF0000UL
/* CANFD_CH_M_TTCAN.TSCV */
#define CANFD_CH_M_TTCAN_TSCV_TSC_Pos           0UL
#define CANFD_CH_M_TTCAN_TSCV_TSC_Msk           0xFFFFUL
/* CANFD_CH_M_TTCAN.TOCC */
#define CANFD_CH_M_TTCAN_TOCC_ETOC_Pos          0UL
#define CANFD_CH_M_TTCAN_TOCC_ETOC_Msk          0x1UL
#define CANFD_CH_M_TTCAN_TOCC_TOS_Pos           1UL
#define CANFD_CH_M_TTCAN_TOCC_TOS_Msk           0x6UL
#define CANFD_CH_M_TTCAN_TOCC_TOP_Pos           16UL
#define CANFD_CH_M_TTCAN_TOCC_TOP_Msk           0xFFFF0000UL
/* CANFD_CH_M_TTCAN.TOCV */
#define CANFD_CH_M_TTCAN_TOCV_TOC_Pos           0UL
#define CANFD_CH_M_TTCAN_TOCV_TOC_Msk           0xFFFFUL
/* CANFD_CH_M_TTCAN.ECR */
#define CANFD_CH_M_TTCAN_ECR_TEC_Pos            0UL
#define CANFD_CH_M_TTCAN_ECR_TEC_Msk            0xFFUL
#define CANFD_CH_M_TTCAN_ECR_REC_Pos            8UL
#define CANFD_CH_M_TTCAN_ECR_REC_Msk            0x7F00UL
#define CANFD_CH_M_TTCAN_ECR_RP_Pos             15UL
#define CANFD_CH_M_TTCAN_ECR_RP_Msk             0x8000UL
#define CANFD_CH_M_TTCAN_ECR_CEL_Pos            16UL
#define CANFD_CH_M_TTCAN_ECR_CEL_Msk            0xFF0000UL
/* CANFD_CH_M_TTCAN.PSR */
#define CANFD_CH_M_TTCAN_PSR_LEC_Pos            0UL
#define CANFD_CH_M_TTCAN_PSR_LEC_Msk            0x7UL
#define CANFD_CH_M_TTCAN_PSR_ACT_Pos            3UL
#define CANFD_CH_M_TTCAN_PSR_ACT_Msk            0x18UL
#define CANFD_CH_M_TTCAN_PSR_EP_Pos             5UL
#define CANFD_CH_M_TTCAN_PSR_EP_Msk             0x20UL
#define CANFD_CH_M_TTCAN_PSR_EW_Pos             6UL
#define CANFD_CH_M_TTCAN_PSR_EW_Msk             0x40UL
#define CANFD_CH_M_TTCAN_PSR_BO_Pos             7UL
#define CANFD_CH_M_TTCAN_PSR_BO_Msk             0x80UL
#define CANFD_CH_M_TTCAN_PSR_DLEC_Pos           8UL
#define CANFD_CH_M_TTCAN_PSR_DLEC_Msk           0x700UL
#define CANFD_CH_M_TTCAN_PSR_RESI_Pos           11UL
#define CANFD_CH_M_TTCAN_PSR_RESI_Msk           0x800UL
#define CANFD_CH_M_TTCAN_PSR_RBRS_Pos           12UL
#define CANFD_CH_M_TTCAN_PSR_RBRS_Msk           0x1000UL
#define CANFD_CH_M_TTCAN_PSR_RFDF_Pos           13UL
#define CANFD_CH_M_TTCAN_PSR_RFDF_Msk           0x2000UL
#define CANFD_CH_M_TTCAN_PSR_PXE_Pos            14UL
#define CANFD_CH_M_TTCAN_PSR_PXE_Msk            0x4000UL
#define CANFD_CH_M_TTCAN_PSR_TDCV_Pos           16UL
#define CANFD_CH_M_TTCAN_PSR_TDCV_Msk           0x7F0000UL
/* CANFD_CH_M_TTCAN.TDCR */
#define CANFD_CH_M_TTCAN_TDCR_TDCF_Pos          0UL
#define CANFD_CH_M_TTCAN_TDCR_TDCF_Msk          0x7FUL
#define CANFD_CH_M_TTCAN_TDCR_TDCO_Pos          8UL
#define CANFD_CH_M_TTCAN_TDCR_TDCO_Msk          0x7F00UL
/* CANFD_CH_M_TTCAN.IR */
#define CANFD_CH_M_TTCAN_IR_RF0N_Pos            0UL
#define CANFD_CH_M_TTCAN_IR_RF0N_Msk            0x1UL
#define CANFD_CH_M_TTCAN_IR_RF0W_Pos            1UL
#define CANFD_CH_M_TTCAN_IR_RF0W_Msk            0x2UL
#define CANFD_CH_M_TTCAN_IR_RF0F_Pos            2UL
#define CANFD_CH_M_TTCAN_IR_RF0F_Msk            0x4UL
#define CANFD_CH_M_TTCAN_IR_RF0L__Pos           3UL
#define CANFD_CH_M_TTCAN_IR_RF0L__Msk           0x8UL
#define CANFD_CH_M_TTCAN_IR_RF1N_Pos            4UL
#define CANFD_CH_M_TTCAN_IR_RF1N_Msk            0x10UL
#define CANFD_CH_M_TTCAN_IR_RF1W_Pos            5UL
#define CANFD_CH_M_TTCAN_IR_RF1W_Msk            0x20UL
#define CANFD_CH_M_TTCAN_IR_RF1F_Pos            6UL
#define CANFD_CH_M_TTCAN_IR_RF1F_Msk            0x40UL
#define CANFD_CH_M_TTCAN_IR_RF1L__Pos           7UL
#define CANFD_CH_M_TTCAN_IR_RF1L__Msk           0x80UL
#define CANFD_CH_M_TTCAN_IR_HPM_Pos             8UL
#define CANFD_CH_M_TTCAN_IR_HPM_Msk             0x100UL
#define CANFD_CH_M_TTCAN_IR_TC_Pos              9UL
#define CANFD_CH_M_TTCAN_IR_TC_Msk              0x200UL
#define CANFD_CH_M_TTCAN_IR_TCF_Pos             10UL
#define CANFD_CH_M_TTCAN_IR_TCF_Msk             0x400UL
#define CANFD_CH_M_TTCAN_IR_TFE_Pos             11UL
#define CANFD_CH_M_TTCAN_IR_TFE_Msk             0x800UL
#define CANFD_CH_M_TTCAN_IR_TEFN_Pos            12UL
#define CANFD_CH_M_TTCAN_IR_TEFN_Msk            0x1000UL
#define CANFD_CH_M_TTCAN_IR_TEFW_Pos            13UL
#define CANFD_CH_M_TTCAN_IR_TEFW_Msk            0x2000UL
#define CANFD_CH_M_TTCAN_IR_TEFF_Pos            14UL
#define CANFD_CH_M_TTCAN_IR_TEFF_Msk            0x4000UL
#define CANFD_CH_M_TTCAN_IR_TEFL__Pos           15UL
#define CANFD_CH_M_TTCAN_IR_TEFL__Msk           0x8000UL
#define CANFD_CH_M_TTCAN_IR_TSW_Pos             16UL
#define CANFD_CH_M_TTCAN_IR_TSW_Msk             0x10000UL
#define CANFD_CH_M_TTCAN_IR_MRAF_Pos            17UL
#define CANFD_CH_M_TTCAN_IR_MRAF_Msk            0x20000UL
#define CANFD_CH_M_TTCAN_IR_TOO_Pos             18UL
#define CANFD_CH_M_TTCAN_IR_TOO_Msk             0x40000UL
#define CANFD_CH_M_TTCAN_IR_DRX_Pos             19UL
#define CANFD_CH_M_TTCAN_IR_DRX_Msk             0x80000UL
#define CANFD_CH_M_TTCAN_IR_BEC_Pos             20UL
#define CANFD_CH_M_TTCAN_IR_BEC_Msk             0x100000UL
#define CANFD_CH_M_TTCAN_IR_BEU_Pos             21UL
#define CANFD_CH_M_TTCAN_IR_BEU_Msk             0x200000UL
#define CANFD_CH_M_TTCAN_IR_ELO_Pos             22UL
#define CANFD_CH_M_TTCAN_IR_ELO_Msk             0x400000UL
#define CANFD_CH_M_TTCAN_IR_EP__Pos             23UL
#define CANFD_CH_M_TTCAN_IR_EP__Msk             0x800000UL
#define CANFD_CH_M_TTCAN_IR_EW__Pos             24UL
#define CANFD_CH_M_TTCAN_IR_EW__Msk             0x1000000UL
#define CANFD_CH_M_TTCAN_IR_BO__Pos             25UL
#define CANFD_CH_M_TTCAN_IR_BO__Msk             0x2000000UL
#define CANFD_CH_M_TTCAN_IR_WDI_Pos             26UL
#define CANFD_CH_M_TTCAN_IR_WDI_Msk             0x4000000UL
#define CANFD_CH_M_TTCAN_IR_PEA_Pos             27UL
#define CANFD_CH_M_TTCAN_IR_PEA_Msk             0x8000000UL
#define CANFD_CH_M_TTCAN_IR_PED_Pos             28UL
#define CANFD_CH_M_TTCAN_IR_PED_Msk             0x10000000UL
#define CANFD_CH_M_TTCAN_IR_ARA_Pos             29UL
#define CANFD_CH_M_TTCAN_IR_ARA_Msk             0x20000000UL
/* CANFD_CH_M_TTCAN.IE */
#define CANFD_CH_M_TTCAN_IE_RF0NE_Pos           0UL
#define CANFD_CH_M_TTCAN_IE_RF0NE_Msk           0x1UL
#define CANFD_CH_M_TTCAN_IE_RF0WE_Pos           1UL
#define CANFD_CH_M_TTCAN_IE_RF0WE_Msk           0x2UL
#define CANFD_CH_M_TTCAN_IE_RF0FE_Pos           2UL
#define CANFD_CH_M_TTCAN_IE_RF0FE_Msk           0x4UL
#define CANFD_CH_M_TTCAN_IE_RF0LE_Pos           3UL
#define CANFD_CH_M_TTCAN_IE_RF0LE_Msk           0x8UL
#define CANFD_CH_M_TTCAN_IE_RF1NE_Pos           4UL
#define CANFD_CH_M_TTCAN_IE_RF1NE_Msk           0x10UL
#define CANFD_CH_M_TTCAN_IE_RF1WE_Pos           5UL
#define CANFD_CH_M_TTCAN_IE_RF1WE_Msk           0x20UL
#define CANFD_CH_M_TTCAN_IE_RF1FE_Pos           6UL
#define CANFD_CH_M_TTCAN_IE_RF1FE_Msk           0x40UL
#define CANFD_CH_M_TTCAN_IE_RF1LE_Pos           7UL
#define CANFD_CH_M_TTCAN_IE_RF1LE_Msk           0x80UL
#define CANFD_CH_M_TTCAN_IE_HPME_Pos            8UL
#define CANFD_CH_M_TTCAN_IE_HPME_Msk            0x100UL
#define CANFD_CH_M_TTCAN_IE_TCE_Pos             9UL
#define CANFD_CH_M_TTCAN_IE_TCE_Msk             0x200UL
#define CANFD_CH_M_TTCAN_IE_TCFE_Pos            10UL
#define CANFD_CH_M_TTCAN_IE_TCFE_Msk            0x400UL
#define CANFD_CH_M_TTCAN_IE_TFEE_Pos            11UL
#define CANFD_CH_M_TTCAN_IE_TFEE_Msk            0x800UL
#define CANFD_CH_M_TTCAN_IE_TEFNE_Pos           12UL
#define CANFD_CH_M_TTCAN_IE_TEFNE_Msk           0x1000UL
#define CANFD_CH_M_TTCAN_IE_TEFWE_Pos           13UL
#define CANFD_CH_M_TTCAN_IE_TEFWE_Msk           0x2000UL
#define CANFD_CH_M_TTCAN_IE_TEFFE_Pos           14UL
#define CANFD_CH_M_TTCAN_IE_TEFFE_Msk           0x4000UL
#define CANFD_CH_M_TTCAN_IE_TEFLE_Pos           15UL
#define CANFD_CH_M_TTCAN_IE_TEFLE_Msk           0x8000UL
#define CANFD_CH_M_TTCAN_IE_TSWE_Pos            16UL
#define CANFD_CH_M_TTCAN_IE_TSWE_Msk            0x10000UL
#define CANFD_CH_M_TTCAN_IE_MRAFE_Pos           17UL
#define CANFD_CH_M_TTCAN_IE_MRAFE_Msk           0x20000UL
#define CANFD_CH_M_TTCAN_IE_TOOE_Pos            18UL
#define CANFD_CH_M_TTCAN_IE_TOOE_Msk            0x40000UL
#define CANFD_CH_M_TTCAN_IE_DRXE_Pos            19UL
#define CANFD_CH_M_TTCAN_IE_DRXE_Msk            0x80000UL
#define CANFD_CH_M_TTCAN_IE_BECE_Pos            20UL
#define CANFD_CH_M_TTCAN_IE_BECE_Msk            0x100000UL
#define CANFD_CH_M_TTCAN_IE_BEUE_Pos            21UL
#define CANFD_CH_M_TTCAN_IE_BEUE_Msk            0x200000UL
#define CANFD_CH_M_TTCAN_IE_ELOE_Pos            22UL
#define CANFD_CH_M_TTCAN_IE_ELOE_Msk            0x400000UL
#define CANFD_CH_M_TTCAN_IE_EPE_Pos             23UL
#define CANFD_CH_M_TTCAN_IE_EPE_Msk             0x800000UL
#define CANFD_CH_M_TTCAN_IE_EWE_Pos             24UL
#define CANFD_CH_M_TTCAN_IE_EWE_Msk             0x1000000UL
#define CANFD_CH_M_TTCAN_IE_BOE_Pos             25UL
#define CANFD_CH_M_TTCAN_IE_BOE_Msk             0x2000000UL
#define CANFD_CH_M_TTCAN_IE_WDIE_Pos            26UL
#define CANFD_CH_M_TTCAN_IE_WDIE_Msk            0x4000000UL
#define CANFD_CH_M_TTCAN_IE_PEAE_Pos            27UL
#define CANFD_CH_M_TTCAN_IE_PEAE_Msk            0x8000000UL
#define CANFD_CH_M_TTCAN_IE_PEDE_Pos            28UL
#define CANFD_CH_M_TTCAN_IE_PEDE_Msk            0x10000000UL
#define CANFD_CH_M_TTCAN_IE_ARAE_Pos            29UL
#define CANFD_CH_M_TTCAN_IE_ARAE_Msk            0x20000000UL
/* CANFD_CH_M_TTCAN.ILS */
#define CANFD_CH_M_TTCAN_ILS_RF0NL_Pos          0UL
#define CANFD_CH_M_TTCAN_ILS_RF0NL_Msk          0x1UL
#define CANFD_CH_M_TTCAN_ILS_RF0WL_Pos          1UL
#define CANFD_CH_M_TTCAN_ILS_RF0WL_Msk          0x2UL
#define CANFD_CH_M_TTCAN_ILS_RF0FL_Pos          2UL
#define CANFD_CH_M_TTCAN_ILS_RF0FL_Msk          0x4UL
#define CANFD_CH_M_TTCAN_ILS_RF0LL_Pos          3UL
#define CANFD_CH_M_TTCAN_ILS_RF0LL_Msk          0x8UL
#define CANFD_CH_M_TTCAN_ILS_RF1NL_Pos          4UL
#define CANFD_CH_M_TTCAN_ILS_RF1NL_Msk          0x10UL
#define CANFD_CH_M_TTCAN_ILS_RF1WL_Pos          5UL
#define CANFD_CH_M_TTCAN_ILS_RF1WL_Msk          0x20UL
#define CANFD_CH_M_TTCAN_ILS_RF1FL_Pos          6UL
#define CANFD_CH_M_TTCAN_ILS_RF1FL_Msk          0x40UL
#define CANFD_CH_M_TTCAN_ILS_RF1LL_Pos          7UL
#define CANFD_CH_M_TTCAN_ILS_RF1LL_Msk          0x80UL
#define CANFD_CH_M_TTCAN_ILS_HPML_Pos           8UL
#define CANFD_CH_M_TTCAN_ILS_HPML_Msk           0x100UL
#define CANFD_CH_M_TTCAN_ILS_TCL_Pos            9UL
#define CANFD_CH_M_TTCAN_ILS_TCL_Msk            0x200UL
#define CANFD_CH_M_TTCAN_ILS_TCFL_Pos           10UL
#define CANFD_CH_M_TTCAN_ILS_TCFL_Msk           0x400UL
#define CANFD_CH_M_TTCAN_ILS_TFEL_Pos           11UL
#define CANFD_CH_M_TTCAN_ILS_TFEL_Msk           0x800UL
#define CANFD_CH_M_TTCAN_ILS_TEFNL_Pos          12UL
#define CANFD_CH_M_TTCAN_ILS_TEFNL_Msk          0x1000UL
#define CANFD_CH_M_TTCAN_ILS_TEFWL_Pos          13UL
#define CANFD_CH_M_TTCAN_ILS_TEFWL_Msk          0x2000UL
#define CANFD_CH_M_TTCAN_ILS_TEFFL_Pos          14UL
#define CANFD_CH_M_TTCAN_ILS_TEFFL_Msk          0x4000UL
#define CANFD_CH_M_TTCAN_ILS_TEFLL_Pos          15UL
#define CANFD_CH_M_TTCAN_ILS_TEFLL_Msk          0x8000UL
#define CANFD_CH_M_TTCAN_ILS_TSWL_Pos           16UL
#define CANFD_CH_M_TTCAN_ILS_TSWL_Msk           0x10000UL
#define CANFD_CH_M_TTCAN_ILS_MRAFL_Pos          17UL
#define CANFD_CH_M_TTCAN_ILS_MRAFL_Msk          0x20000UL
#define CANFD_CH_M_TTCAN_ILS_TOOL_Pos           18UL
#define CANFD_CH_M_TTCAN_ILS_TOOL_Msk           0x40000UL
#define CANFD_CH_M_TTCAN_ILS_DRXL_Pos           19UL
#define CANFD_CH_M_TTCAN_ILS_DRXL_Msk           0x80000UL
#define CANFD_CH_M_TTCAN_ILS_BECL_Pos           20UL
#define CANFD_CH_M_TTCAN_ILS_BECL_Msk           0x100000UL
#define CANFD_CH_M_TTCAN_ILS_BEUL_Pos           21UL
#define CANFD_CH_M_TTCAN_ILS_BEUL_Msk           0x200000UL
#define CANFD_CH_M_TTCAN_ILS_ELOL_Pos           22UL
#define CANFD_CH_M_TTCAN_ILS_ELOL_Msk           0x400000UL
#define CANFD_CH_M_TTCAN_ILS_EPL_Pos            23UL
#define CANFD_CH_M_TTCAN_ILS_EPL_Msk            0x800000UL
#define CANFD_CH_M_TTCAN_ILS_EWL_Pos            24UL
#define CANFD_CH_M_TTCAN_ILS_EWL_Msk            0x1000000UL
#define CANFD_CH_M_TTCAN_ILS_BOL_Pos            25UL
#define CANFD_CH_M_TTCAN_ILS_BOL_Msk            0x2000000UL
#define CANFD_CH_M_TTCAN_ILS_WDIL_Pos           26UL
#define CANFD_CH_M_TTCAN_ILS_WDIL_Msk           0x4000000UL
#define CANFD_CH_M_TTCAN_ILS_PEAL_Pos           27UL
#define CANFD_CH_M_TTCAN_ILS_PEAL_Msk           0x8000000UL
#define CANFD_CH_M_TTCAN_ILS_PEDL_Pos           28UL
#define CANFD_CH_M_TTCAN_ILS_PEDL_Msk           0x10000000UL
#define CANFD_CH_M_TTCAN_ILS_ARAL_Pos           29UL
#define CANFD_CH_M_TTCAN_ILS_ARAL_Msk           0x20000000UL
/* CANFD_CH_M_TTCAN.ILE */
#define CANFD_CH_M_TTCAN_ILE_EINT0_Pos          0UL
#define CANFD_CH_M_TTCAN_ILE_EINT0_Msk          0x1UL
#define CANFD_CH_M_TTCAN_ILE_EINT1_Pos          1UL
#define CANFD_CH_M_TTCAN_ILE_EINT1_Msk          0x2UL
/* CANFD_CH_M_TTCAN.GFC */
#define CANFD_CH_M_TTCAN_GFC_RRFE_Pos           0UL
#define CANFD_CH_M_TTCAN_GFC_RRFE_Msk           0x1UL
#define CANFD_CH_M_TTCAN_GFC_RRFS_Pos           1UL
#define CANFD_CH_M_TTCAN_GFC_RRFS_Msk           0x2UL
#define CANFD_CH_M_TTCAN_GFC_ANFE_Pos           2UL
#define CANFD_CH_M_TTCAN_GFC_ANFE_Msk           0xCUL
#define CANFD_CH_M_TTCAN_GFC_ANFS_Pos           4UL
#define CANFD_CH_M_TTCAN_GFC_ANFS_Msk           0x30UL
/* CANFD_CH_M_TTCAN.SIDFC */
#define CANFD_CH_M_TTCAN_SIDFC_FLSSA_Pos        2UL
#define CANFD_CH_M_TTCAN_SIDFC_FLSSA_Msk        0xFFFCUL
#define CANFD_CH_M_TTCAN_SIDFC_LSS_Pos          16UL
#define CANFD_CH_M_TTCAN_SIDFC_LSS_Msk          0xFF0000UL
/* CANFD_CH_M_TTCAN.XIDFC */
#define CANFD_CH_M_TTCAN_XIDFC_FLESA_Pos        2UL
#define CANFD_CH_M_TTCAN_XIDFC_FLESA_Msk        0xFFFCUL
#define CANFD_CH_M_TTCAN_XIDFC_LSE_Pos          16UL
#define CANFD_CH_M_TTCAN_XIDFC_LSE_Msk          0x7F0000UL
/* CANFD_CH_M_TTCAN.XIDAM */
#define CANFD_CH_M_TTCAN_XIDAM_EIDM_Pos         0UL
#define CANFD_CH_M_TTCAN_XIDAM_EIDM_Msk         0x1FFFFFFFUL
/* CANFD_CH_M_TTCAN.HPMS */
#define CANFD_CH_M_TTCAN_HPMS_BIDX_Pos          0UL
#define CANFD_CH_M_TTCAN_HPMS_BIDX_Msk          0x3FUL
#define CANFD_CH_M_TTCAN_HPMS_MSI_Pos           6UL
#define CANFD_CH_M_TTCAN_HPMS_MSI_Msk           0xC0UL
#define CANFD_CH_M_TTCAN_HPMS_FIDX_Pos          8UL
#define CANFD_CH_M_TTCAN_HPMS_FIDX_Msk          0x7F00UL
#define CANFD_CH_M_TTCAN_HPMS_FLST_Pos          15UL
#define CANFD_CH_M_TTCAN_HPMS_FLST_Msk          0x8000UL
/* CANFD_CH_M_TTCAN.NDAT1 */
#define CANFD_CH_M_TTCAN_NDAT1_ND_Pos           0UL
#define CANFD_CH_M_TTCAN_NDAT1_ND_Msk           0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.NDAT2 */
#define CANFD_CH_M_TTCAN_NDAT2_ND_Pos           0UL
#define CANFD_CH_M_TTCAN_NDAT2_ND_Msk           0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.RXF0C */
#define CANFD_CH_M_TTCAN_RXF0C_F0SA_Pos         2UL
#define CANFD_CH_M_TTCAN_RXF0C_F0SA_Msk         0xFFFCUL
#define CANFD_CH_M_TTCAN_RXF0C_F0S_Pos          16UL
#define CANFD_CH_M_TTCAN_RXF0C_F0S_Msk          0x7F0000UL
#define CANFD_CH_M_TTCAN_RXF0C_F0WM_Pos         24UL
#define CANFD_CH_M_TTCAN_RXF0C_F0WM_Msk         0x7F000000UL
#define CANFD_CH_M_TTCAN_RXF0C_F0OM_Pos         31UL
#define CANFD_CH_M_TTCAN_RXF0C_F0OM_Msk         0x80000000UL
/* CANFD_CH_M_TTCAN.RXF0S */
#define CANFD_CH_M_TTCAN_RXF0S_F0FL_Pos         0UL
#define CANFD_CH_M_TTCAN_RXF0S_F0FL_Msk         0x7FUL
#define CANFD_CH_M_TTCAN_RXF0S_F0GI_Pos         8UL
#define CANFD_CH_M_TTCAN_RXF0S_F0GI_Msk         0x3F00UL
#define CANFD_CH_M_TTCAN_RXF0S_F0PI_Pos         16UL
#define CANFD_CH_M_TTCAN_RXF0S_F0PI_Msk         0x3F0000UL
#define CANFD_CH_M_TTCAN_RXF0S_F0F_Pos          24UL
#define CANFD_CH_M_TTCAN_RXF0S_F0F_Msk          0x1000000UL
#define CANFD_CH_M_TTCAN_RXF0S_RF0L_Pos         25UL
#define CANFD_CH_M_TTCAN_RXF0S_RF0L_Msk         0x2000000UL
/* CANFD_CH_M_TTCAN.RXF0A */
#define CANFD_CH_M_TTCAN_RXF0A_F0AI_Pos         0UL
#define CANFD_CH_M_TTCAN_RXF0A_F0AI_Msk         0x3FUL
/* CANFD_CH_M_TTCAN.RXBC */
#define CANFD_CH_M_TTCAN_RXBC_RBSA_Pos          2UL
#define CANFD_CH_M_TTCAN_RXBC_RBSA_Msk          0xFFFCUL
/* CANFD_CH_M_TTCAN.RXF1C */
#define CANFD_CH_M_TTCAN_RXF1C_F1SA_Pos         2UL
#define CANFD_CH_M_TTCAN_RXF1C_F1SA_Msk         0xFFFCUL
#define CANFD_CH_M_TTCAN_RXF1C_F1S_Pos          16UL
#define CANFD_CH_M_TTCAN_RXF1C_F1S_Msk          0x7F0000UL
#define CANFD_CH_M_TTCAN_RXF1C_F1WM_Pos         24UL
#define CANFD_CH_M_TTCAN_RXF1C_F1WM_Msk         0x7F000000UL
#define CANFD_CH_M_TTCAN_RXF1C_F1OM_Pos         31UL
#define CANFD_CH_M_TTCAN_RXF1C_F1OM_Msk         0x80000000UL
/* CANFD_CH_M_TTCAN.RXF1S */
#define CANFD_CH_M_TTCAN_RXF1S_F1FL_Pos         0UL
#define CANFD_CH_M_TTCAN_RXF1S_F1FL_Msk         0x7FUL
#define CANFD_CH_M_TTCAN_RXF1S_F1GI_Pos         8UL
#define CANFD_CH_M_TTCAN_RXF1S_F1GI_Msk         0x3F00UL
#define CANFD_CH_M_TTCAN_RXF1S_F1PI_Pos         16UL
#define CANFD_CH_M_TTCAN_RXF1S_F1PI_Msk         0x3F0000UL
#define CANFD_CH_M_TTCAN_RXF1S_F1F_Pos          24UL
#define CANFD_CH_M_TTCAN_RXF1S_F1F_Msk          0x1000000UL
#define CANFD_CH_M_TTCAN_RXF1S_RF1L_Pos         25UL
#define CANFD_CH_M_TTCAN_RXF1S_RF1L_Msk         0x2000000UL
#define CANFD_CH_M_TTCAN_RXF1S_DMS_Pos          30UL
#define CANFD_CH_M_TTCAN_RXF1S_DMS_Msk          0xC0000000UL
/* CANFD_CH_M_TTCAN.RXF1A */
#define CANFD_CH_M_TTCAN_RXF1A_F1AI_Pos         0UL
#define CANFD_CH_M_TTCAN_RXF1A_F1AI_Msk         0x3FUL
/* CANFD_CH_M_TTCAN.RXESC */
#define CANFD_CH_M_TTCAN_RXESC_F0DS_Pos         0UL
#define CANFD_CH_M_TTCAN_RXESC_F0DS_Msk         0x7UL
#define CANFD_CH_M_TTCAN_RXESC_F1DS_Pos         4UL
#define CANFD_CH_M_TTCAN_RXESC_F1DS_Msk         0x70UL
#define CANFD_CH_M_TTCAN_RXESC_RBDS_Pos         8UL
#define CANFD_CH_M_TTCAN_RXESC_RBDS_Msk         0x700UL
/* CANFD_CH_M_TTCAN.TXBC */
#define CANFD_CH_M_TTCAN_TXBC_TBSA_Pos          2UL
#define CANFD_CH_M_TTCAN_TXBC_TBSA_Msk          0xFFFCUL
#define CANFD_CH_M_TTCAN_TXBC_NDTB_Pos          16UL
#define CANFD_CH_M_TTCAN_TXBC_NDTB_Msk          0x3F0000UL
#define CANFD_CH_M_TTCAN_TXBC_TFQS_Pos          24UL
#define CANFD_CH_M_TTCAN_TXBC_TFQS_Msk          0x3F000000UL
#define CANFD_CH_M_TTCAN_TXBC_TFQM_Pos          30UL
#define CANFD_CH_M_TTCAN_TXBC_TFQM_Msk          0x40000000UL
/* CANFD_CH_M_TTCAN.TXFQS */
#define CANFD_CH_M_TTCAN_TXFQS_TFFL_Pos         0UL
#define CANFD_CH_M_TTCAN_TXFQS_TFFL_Msk         0x3FUL
#define CANFD_CH_M_TTCAN_TXFQS_TFGI_Pos         8UL
#define CANFD_CH_M_TTCAN_TXFQS_TFGI_Msk         0x1F00UL
#define CANFD_CH_M_TTCAN_TXFQS_TFQPI_Pos        16UL
#define CANFD_CH_M_TTCAN_TXFQS_TFQPI_Msk        0x1F0000UL
#define CANFD_CH_M_TTCAN_TXFQS_TFQF_Pos         21UL
#define CANFD_CH_M_TTCAN_TXFQS_TFQF_Msk         0x200000UL
/* CANFD_CH_M_TTCAN.TXESC */
#define CANFD_CH_M_TTCAN_TXESC_TBDS_Pos         0UL
#define CANFD_CH_M_TTCAN_TXESC_TBDS_Msk         0x7UL
/* CANFD_CH_M_TTCAN.TXBRP */
#define CANFD_CH_M_TTCAN_TXBRP_TRP_Pos          0UL
#define CANFD_CH_M_TTCAN_TXBRP_TRP_Msk          0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.TXBAR */
#define CANFD_CH_M_TTCAN_TXBAR_AR_Pos           0UL
#define CANFD_CH_M_TTCAN_TXBAR_AR_Msk           0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.TXBCR */
#define CANFD_CH_M_TTCAN_TXBCR_CR_Pos           0UL
#define CANFD_CH_M_TTCAN_TXBCR_CR_Msk           0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.TXBTO */
#define CANFD_CH_M_TTCAN_TXBTO_TO_Pos           0UL
#define CANFD_CH_M_TTCAN_TXBTO_TO_Msk           0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.TXBCF */
