MikroElektronika/core_packages/ARM/gcc_clang/system/src/infineon/cy8c4148lda/thirdparty/cy8c4148lda/ip/cyip_canfd_v2.h
#define CANFD_CH_M_TTCAN_TXBCF_CF_Pos           0UL
#define CANFD_CH_M_TTCAN_TXBCF_CF_Msk           0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.TXBTIE */
#define CANFD_CH_M_TTCAN_TXBTIE_TIE_Pos         0UL
#define CANFD_CH_M_TTCAN_TXBTIE_TIE_Msk         0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.TXBCIE */
#define CANFD_CH_M_TTCAN_TXBCIE_CFIE_Pos        0UL
#define CANFD_CH_M_TTCAN_TXBCIE_CFIE_Msk        0xFFFFFFFFUL
/* CANFD_CH_M_TTCAN.TXEFC */
#define CANFD_CH_M_TTCAN_TXEFC_EFSA_Pos         2UL
#define CANFD_CH_M_TTCAN_TXEFC_EFSA_Msk         0xFFFCUL
#define CANFD_CH_M_TTCAN_TXEFC_EFS_Pos          16UL
#define CANFD_CH_M_TTCAN_TXEFC_EFS_Msk          0x3F0000UL
#define CANFD_CH_M_TTCAN_TXEFC_EFWM_Pos         24UL
#define CANFD_CH_M_TTCAN_TXEFC_EFWM_Msk         0x3F000000UL
/* CANFD_CH_M_TTCAN.TXEFS */
#define CANFD_CH_M_TTCAN_TXEFS_EFFL_Pos         0UL
#define CANFD_CH_M_TTCAN_TXEFS_EFFL_Msk         0x3FUL
#define CANFD_CH_M_TTCAN_TXEFS_EFGI_Pos         8UL
#define CANFD_CH_M_TTCAN_TXEFS_EFGI_Msk         0x1F00UL
#define CANFD_CH_M_TTCAN_TXEFS_EFPI_Pos         16UL
#define CANFD_CH_M_TTCAN_TXEFS_EFPI_Msk         0x1F0000UL
#define CANFD_CH_M_TTCAN_TXEFS_EFF_Pos          24UL
#define CANFD_CH_M_TTCAN_TXEFS_EFF_Msk          0x1000000UL
#define CANFD_CH_M_TTCAN_TXEFS_TEFL_Pos         25UL
#define CANFD_CH_M_TTCAN_TXEFS_TEFL_Msk         0x2000000UL
/* CANFD_CH_M_TTCAN.TXEFA */
#define CANFD_CH_M_TTCAN_TXEFA_EFAI_Pos         0UL
#define CANFD_CH_M_TTCAN_TXEFA_EFAI_Msk         0x1FUL
/* CANFD_CH_M_TTCAN.TTTMC */
#define CANFD_CH_M_TTCAN_TTTMC_TMSA_Pos         2UL
#define CANFD_CH_M_TTCAN_TTTMC_TMSA_Msk         0xFFFCUL
#define CANFD_CH_M_TTCAN_TTTMC_TME_Pos          16UL
#define CANFD_CH_M_TTCAN_TTTMC_TME_Msk          0x7F0000UL
/* CANFD_CH_M_TTCAN.TTRMC */
#define CANFD_CH_M_TTCAN_TTRMC_RID_Pos          0UL
#define CANFD_CH_M_TTCAN_TTRMC_RID_Msk          0x1FFFFFFFUL
#define CANFD_CH_M_TTCAN_TTRMC_XTD_Pos          30UL
#define CANFD_CH_M_TTCAN_TTRMC_XTD_Msk          0x40000000UL
#define CANFD_CH_M_TTCAN_TTRMC_RMPS_Pos         31UL
#define CANFD_CH_M_TTCAN_TTRMC_RMPS_Msk         0x80000000UL
/* CANFD_CH_M_TTCAN.TTOCF */
#define CANFD_CH_M_TTCAN_TTOCF_OM_Pos           0UL
#define CANFD_CH_M_TTCAN_TTOCF_OM_Msk           0x3UL
#define CANFD_CH_M_TTCAN_TTOCF_GEN_Pos          3UL
#define CANFD_CH_M_TTCAN_TTOCF_GEN_Msk          0x8UL
#define CANFD_CH_M_TTCAN_TTOCF_TM_Pos           4UL
#define CANFD_CH_M_TTCAN_TTOCF_TM_Msk           0x10UL
#define CANFD_CH_M_TTCAN_TTOCF_LDSDL_Pos        5UL
#define CANFD_CH_M_TTCAN_TTOCF_LDSDL_Msk        0xE0UL
#define CANFD_CH_M_TTCAN_TTOCF_IRTO_Pos         8UL
#define CANFD_CH_M_TTCAN_TTOCF_IRTO_Msk         0x7F00UL
#define CANFD_CH_M_TTCAN_TTOCF_EECS_Pos         15UL
#define CANFD_CH_M_TTCAN_TTOCF_EECS_Msk         0x8000UL
#define CANFD_CH_M_TTCAN_TTOCF_AWL_Pos          16UL
#define CANFD_CH_M_TTCAN_TTOCF_AWL_Msk          0xFF0000UL
#define CANFD_CH_M_TTCAN_TTOCF_EGTF_Pos         24UL
#define CANFD_CH_M_TTCAN_TTOCF_EGTF_Msk         0x1000000UL
#define CANFD_CH_M_TTCAN_TTOCF_ECC_Pos          25UL
#define CANFD_CH_M_TTCAN_TTOCF_ECC_Msk          0x2000000UL
#define CANFD_CH_M_TTCAN_TTOCF_EVTP_Pos         26UL
#define CANFD_CH_M_TTCAN_TTOCF_EVTP_Msk         0x4000000UL
/* CANFD_CH_M_TTCAN.TTMLM */
#define CANFD_CH_M_TTCAN_TTMLM_CCM_Pos          0UL
#define CANFD_CH_M_TTCAN_TTMLM_CCM_Msk          0x3FUL
#define CANFD_CH_M_TTCAN_TTMLM_CSS_Pos          6UL
#define CANFD_CH_M_TTCAN_TTMLM_CSS_Msk          0xC0UL
#define CANFD_CH_M_TTCAN_TTMLM_TXEW_Pos         8UL
#define CANFD_CH_M_TTCAN_TTMLM_TXEW_Msk         0xF00UL
#define CANFD_CH_M_TTCAN_TTMLM_ENTT_Pos         16UL
#define CANFD_CH_M_TTCAN_TTMLM_ENTT_Msk         0xFFF0000UL
/* CANFD_CH_M_TTCAN.TURCF */
#define CANFD_CH_M_TTCAN_TURCF_NCL_Pos          0UL
#define CANFD_CH_M_TTCAN_TURCF_NCL_Msk          0xFFFFUL
#define CANFD_CH_M_TTCAN_TURCF_DC_Pos           16UL
#define CANFD_CH_M_TTCAN_TURCF_DC_Msk           0x3FFF0000UL
#define CANFD_CH_M_TTCAN_TURCF_ELT_Pos          31UL
#define CANFD_CH_M_TTCAN_TURCF_ELT_Msk          0x80000000UL
/* CANFD_CH_M_TTCAN.TTOCN */
#define CANFD_CH_M_TTCAN_TTOCN_SGT_Pos          0UL
#define CANFD_CH_M_TTCAN_TTOCN_SGT_Msk          0x1UL
#define CANFD_CH_M_TTCAN_TTOCN_ECS_Pos          1UL
#define CANFD_CH_M_TTCAN_TTOCN_ECS_Msk          0x2UL
#define CANFD_CH_M_TTCAN_TTOCN_SWP_Pos          2UL
#define CANFD_CH_M_TTCAN_TTOCN_SWP_Msk          0x4UL
#define CANFD_CH_M_TTCAN_TTOCN_SWS_Pos          3UL
#define CANFD_CH_M_TTCAN_TTOCN_SWS_Msk          0x18UL
#define CANFD_CH_M_TTCAN_TTOCN_RTIE_Pos         5UL
#define CANFD_CH_M_TTCAN_TTOCN_RTIE_Msk         0x20UL
#define CANFD_CH_M_TTCAN_TTOCN_TMC_Pos          6UL
#define CANFD_CH_M_TTCAN_TTOCN_TMC_Msk          0xC0UL
#define CANFD_CH_M_TTCAN_TTOCN_TTIE_Pos         8UL
#define CANFD_CH_M_TTCAN_TTOCN_TTIE_Msk         0x100UL
#define CANFD_CH_M_TTCAN_TTOCN_GCS_Pos          9UL
#define CANFD_CH_M_TTCAN_TTOCN_GCS_Msk          0x200UL
#define CANFD_CH_M_TTCAN_TTOCN_FGP_Pos          10UL
#define CANFD_CH_M_TTCAN_TTOCN_FGP_Msk          0x400UL
#define CANFD_CH_M_TTCAN_TTOCN_TMG_Pos          11UL
#define CANFD_CH_M_TTCAN_TTOCN_TMG_Msk          0x800UL
#define CANFD_CH_M_TTCAN_TTOCN_NIG_Pos          12UL
#define CANFD_CH_M_TTCAN_TTOCN_NIG_Msk          0x1000UL
#define CANFD_CH_M_TTCAN_TTOCN_ESCN_Pos         13UL
#define CANFD_CH_M_TTCAN_TTOCN_ESCN_Msk         0x2000UL
#define CANFD_CH_M_TTCAN_TTOCN_LCKC_Pos         15UL
#define CANFD_CH_M_TTCAN_TTOCN_LCKC_Msk         0x8000UL
/* CANFD_CH_M_TTCAN.TTGTP */
#define CANFD_CH_M_TTCAN_TTGTP_TP_Pos           0UL
#define CANFD_CH_M_TTCAN_TTGTP_TP_Msk           0xFFFFUL
#define CANFD_CH_M_TTCAN_TTGTP_CTP_Pos          16UL
#define CANFD_CH_M_TTCAN_TTGTP_CTP_Msk          0xFFFF0000UL
/* CANFD_CH_M_TTCAN.TTTMK */
#define CANFD_CH_M_TTCAN_TTTMK_TM__Pos          0UL
#define CANFD_CH_M_TTCAN_TTTMK_TM__Msk          0xFFFFUL
#define CANFD_CH_M_TTCAN_TTTMK_TICC_Pos         16UL
#define CANFD_CH_M_TTCAN_TTTMK_TICC_Msk         0x7F0000UL
#define CANFD_CH_M_TTCAN_TTTMK_LCKM_Pos         31UL
#define CANFD_CH_M_TTCAN_TTTMK_LCKM_Msk         0x80000000UL
/* CANFD_CH_M_TTCAN.TTIR */
#define CANFD_CH_M_TTCAN_TTIR_SBC_Pos           0UL
#define CANFD_CH_M_TTCAN_TTIR_SBC_Msk           0x1UL
#define CANFD_CH_M_TTCAN_TTIR_SMC_Pos           1UL
#define CANFD_CH_M_TTCAN_TTIR_SMC_Msk           0x2UL
#define CANFD_CH_M_TTCAN_TTIR_CSM__Pos          2UL
#define CANFD_CH_M_TTCAN_TTIR_CSM__Msk          0x4UL
#define CANFD_CH_M_TTCAN_TTIR_SOG_Pos           3UL
#define CANFD_CH_M_TTCAN_TTIR_SOG_Msk           0x8UL
#define CANFD_CH_M_TTCAN_TTIR_RTMI_Pos          4UL
#define CANFD_CH_M_TTCAN_TTIR_RTMI_Msk          0x10UL
#define CANFD_CH_M_TTCAN_TTIR_TTMI_Pos          5UL
#define CANFD_CH_M_TTCAN_TTIR_TTMI_Msk          0x20UL
#define CANFD_CH_M_TTCAN_TTIR_SWE_Pos           6UL
#define CANFD_CH_M_TTCAN_TTIR_SWE_Msk           0x40UL
#define CANFD_CH_M_TTCAN_TTIR_GTW_Pos           7UL
#define CANFD_CH_M_TTCAN_TTIR_GTW_Msk           0x80UL
#define CANFD_CH_M_TTCAN_TTIR_GTD_Pos           8UL
#define CANFD_CH_M_TTCAN_TTIR_GTD_Msk           0x100UL
#define CANFD_CH_M_TTCAN_TTIR_GTE_Pos           9UL
#define CANFD_CH_M_TTCAN_TTIR_GTE_Msk           0x200UL
#define CANFD_CH_M_TTCAN_TTIR_TXU_Pos           10UL
#define CANFD_CH_M_TTCAN_TTIR_TXU_Msk           0x400UL
#define CANFD_CH_M_TTCAN_TTIR_TXO_Pos           11UL
#define CANFD_CH_M_TTCAN_TTIR_TXO_Msk           0x800UL
#define CANFD_CH_M_TTCAN_TTIR_SE1_Pos           12UL
#define CANFD_CH_M_TTCAN_TTIR_SE1_Msk           0x1000UL
#define CANFD_CH_M_TTCAN_TTIR_SE2_Pos           13UL
#define CANFD_CH_M_TTCAN_TTIR_SE2_Msk           0x2000UL
#define CANFD_CH_M_TTCAN_TTIR_ELC_Pos           14UL
#define CANFD_CH_M_TTCAN_TTIR_ELC_Msk           0x4000UL
#define CANFD_CH_M_TTCAN_TTIR_IWT_Pos           15UL
#define CANFD_CH_M_TTCAN_TTIR_IWT_Msk           0x8000UL
#define CANFD_CH_M_TTCAN_TTIR_WT_Pos            16UL
#define CANFD_CH_M_TTCAN_TTIR_WT_Msk            0x10000UL
#define CANFD_CH_M_TTCAN_TTIR_AW_Pos            17UL
#define CANFD_CH_M_TTCAN_TTIR_AW_Msk            0x20000UL
#define CANFD_CH_M_TTCAN_TTIR_CER_Pos           18UL
#define CANFD_CH_M_TTCAN_TTIR_CER_Msk           0x40000UL
/* CANFD_CH_M_TTCAN.TTIE */
#define CANFD_CH_M_TTCAN_TTIE_SBCE_Pos          0UL
#define CANFD_CH_M_TTCAN_TTIE_SBCE_Msk          0x1UL
#define CANFD_CH_M_TTCAN_TTIE_SMCE_Pos          1UL
#define CANFD_CH_M_TTCAN_TTIE_SMCE_Msk          0x2UL
#define CANFD_CH_M_TTCAN_TTIE_CSME_Pos          2UL
#define CANFD_CH_M_TTCAN_TTIE_CSME_Msk          0x4UL
#define CANFD_CH_M_TTCAN_TTIE_SOGE_Pos          3UL
#define CANFD_CH_M_TTCAN_TTIE_SOGE_Msk          0x8UL
#define CANFD_CH_M_TTCAN_TTIE_RTMIE_Pos         4UL
#define CANFD_CH_M_TTCAN_TTIE_RTMIE_Msk         0x10UL
#define CANFD_CH_M_TTCAN_TTIE_TTMIE_Pos         5UL
#define CANFD_CH_M_TTCAN_TTIE_TTMIE_Msk         0x20UL
#define CANFD_CH_M_TTCAN_TTIE_SWEE_Pos          6UL
#define CANFD_CH_M_TTCAN_TTIE_SWEE_Msk          0x40UL
#define CANFD_CH_M_TTCAN_TTIE_GTWE_Pos          7UL
#define CANFD_CH_M_TTCAN_TTIE_GTWE_Msk          0x80UL
#define CANFD_CH_M_TTCAN_TTIE_GTDE_Pos          8UL
#define CANFD_CH_M_TTCAN_TTIE_GTDE_Msk          0x100UL
#define CANFD_CH_M_TTCAN_TTIE_GTEE_Pos          9UL
#define CANFD_CH_M_TTCAN_TTIE_GTEE_Msk          0x200UL
#define CANFD_CH_M_TTCAN_TTIE_TXUE_Pos          10UL
#define CANFD_CH_M_TTCAN_TTIE_TXUE_Msk          0x400UL
#define CANFD_CH_M_TTCAN_TTIE_TXOE_Pos          11UL
#define CANFD_CH_M_TTCAN_TTIE_TXOE_Msk          0x800UL
#define CANFD_CH_M_TTCAN_TTIE_SE1E_Pos          12UL
#define CANFD_CH_M_TTCAN_TTIE_SE1E_Msk          0x1000UL
#define CANFD_CH_M_TTCAN_TTIE_SE2E_Pos          13UL
#define CANFD_CH_M_TTCAN_TTIE_SE2E_Msk          0x2000UL
#define CANFD_CH_M_TTCAN_TTIE_ELCE_Pos          14UL
#define CANFD_CH_M_TTCAN_TTIE_ELCE_Msk          0x4000UL
#define CANFD_CH_M_TTCAN_TTIE_IWTE_Pos          15UL
#define CANFD_CH_M_TTCAN_TTIE_IWTE_Msk          0x8000UL
#define CANFD_CH_M_TTCAN_TTIE_WTE_Pos           16UL
#define CANFD_CH_M_TTCAN_TTIE_WTE_Msk           0x10000UL
#define CANFD_CH_M_TTCAN_TTIE_AWE__Pos          17UL
#define CANFD_CH_M_TTCAN_TTIE_AWE__Msk          0x20000UL
#define CANFD_CH_M_TTCAN_TTIE_CERE_Pos          18UL
#define CANFD_CH_M_TTCAN_TTIE_CERE_Msk          0x40000UL
/* CANFD_CH_M_TTCAN.TTILS */
#define CANFD_CH_M_TTCAN_TTILS_SBCL_Pos         0UL
#define CANFD_CH_M_TTCAN_TTILS_SBCL_Msk         0x1UL
#define CANFD_CH_M_TTCAN_TTILS_SMCL_Pos         1UL
#define CANFD_CH_M_TTCAN_TTILS_SMCL_Msk         0x2UL
#define CANFD_CH_M_TTCAN_TTILS_CSML_Pos         2UL
#define CANFD_CH_M_TTCAN_TTILS_CSML_Msk         0x4UL
#define CANFD_CH_M_TTCAN_TTILS_SOGL_Pos         3UL
#define CANFD_CH_M_TTCAN_TTILS_SOGL_Msk         0x8UL
#define CANFD_CH_M_TTCAN_TTILS_RTMIL_Pos        4UL
#define CANFD_CH_M_TTCAN_TTILS_RTMIL_Msk        0x10UL
#define CANFD_CH_M_TTCAN_TTILS_TTMIL_Pos        5UL
#define CANFD_CH_M_TTCAN_TTILS_TTMIL_Msk        0x20UL
#define CANFD_CH_M_TTCAN_TTILS_SWEL_Pos         6UL
#define CANFD_CH_M_TTCAN_TTILS_SWEL_Msk         0x40UL
#define CANFD_CH_M_TTCAN_TTILS_GTWL_Pos         7UL
#define CANFD_CH_M_TTCAN_TTILS_GTWL_Msk         0x80UL
#define CANFD_CH_M_TTCAN_TTILS_GTDL_Pos         8UL
#define CANFD_CH_M_TTCAN_TTILS_GTDL_Msk         0x100UL
#define CANFD_CH_M_TTCAN_TTILS_GTEL_Pos         9UL
#define CANFD_CH_M_TTCAN_TTILS_GTEL_Msk         0x200UL
#define CANFD_CH_M_TTCAN_TTILS_TXUL_Pos         10UL
#define CANFD_CH_M_TTCAN_TTILS_TXUL_Msk         0x400UL
#define CANFD_CH_M_TTCAN_TTILS_TXOL_Pos         11UL
#define CANFD_CH_M_TTCAN_TTILS_TXOL_Msk         0x800UL
#define CANFD_CH_M_TTCAN_TTILS_SE1L_Pos         12UL
#define CANFD_CH_M_TTCAN_TTILS_SE1L_Msk         0x1000UL
#define CANFD_CH_M_TTCAN_TTILS_SE2L_Pos         13UL
#define CANFD_CH_M_TTCAN_TTILS_SE2L_Msk         0x2000UL
#define CANFD_CH_M_TTCAN_TTILS_ELCL_Pos         14UL
#define CANFD_CH_M_TTCAN_TTILS_ELCL_Msk         0x4000UL
#define CANFD_CH_M_TTCAN_TTILS_IWTL_Pos         15UL
#define CANFD_CH_M_TTCAN_TTILS_IWTL_Msk         0x8000UL
#define CANFD_CH_M_TTCAN_TTILS_WTL_Pos          16UL
#define CANFD_CH_M_TTCAN_TTILS_WTL_Msk          0x10000UL
#define CANFD_CH_M_TTCAN_TTILS_AWL__Pos         17UL
#define CANFD_CH_M_TTCAN_TTILS_AWL__Msk         0x20000UL
#define CANFD_CH_M_TTCAN_TTILS_CERL_Pos         18UL
#define CANFD_CH_M_TTCAN_TTILS_CERL_Msk         0x40000UL
/* CANFD_CH_M_TTCAN.TTOST */
#define CANFD_CH_M_TTCAN_TTOST_EL_Pos           0UL
#define CANFD_CH_M_TTCAN_TTOST_EL_Msk           0x3UL
#define CANFD_CH_M_TTCAN_TTOST_MS_Pos           2UL
#define CANFD_CH_M_TTCAN_TTOST_MS_Msk           0xCUL
#define CANFD_CH_M_TTCAN_TTOST_SYS_Pos          4UL
#define CANFD_CH_M_TTCAN_TTOST_SYS_Msk          0x30UL
#define CANFD_CH_M_TTCAN_TTOST_QGTP_Pos         6UL
#define CANFD_CH_M_TTCAN_TTOST_QGTP_Msk         0x40UL
#define CANFD_CH_M_TTCAN_TTOST_QCS_Pos          7UL
#define CANFD_CH_M_TTCAN_TTOST_QCS_Msk          0x80UL
#define CANFD_CH_M_TTCAN_TTOST_RTO_Pos          8UL
#define CANFD_CH_M_TTCAN_TTOST_RTO_Msk          0xFF00UL
#define CANFD_CH_M_TTCAN_TTOST_WGTD_Pos         22UL
#define CANFD_CH_M_TTCAN_TTOST_WGTD_Msk         0x400000UL
#define CANFD_CH_M_TTCAN_TTOST_GFI_Pos          23UL
#define CANFD_CH_M_TTCAN_TTOST_GFI_Msk          0x800000UL
#define CANFD_CH_M_TTCAN_TTOST_TMP_Pos          24UL
#define CANFD_CH_M_TTCAN_TTOST_TMP_Msk          0x7000000UL
#define CANFD_CH_M_TTCAN_TTOST_GSI_Pos          27UL
#define CANFD_CH_M_TTCAN_TTOST_GSI_Msk          0x8000000UL
#define CANFD_CH_M_TTCAN_TTOST_WFE_Pos          28UL
#define CANFD_CH_M_TTCAN_TTOST_WFE_Msk          0x10000000UL
#define CANFD_CH_M_TTCAN_TTOST_AWE_Pos          29UL
#define CANFD_CH_M_TTCAN_TTOST_AWE_Msk          0x20000000UL
#define CANFD_CH_M_TTCAN_TTOST_WECS_Pos         30UL
#define CANFD_CH_M_TTCAN_TTOST_WECS_Msk         0x40000000UL
#define CANFD_CH_M_TTCAN_TTOST_SPL_Pos          31UL
#define CANFD_CH_M_TTCAN_TTOST_SPL_Msk          0x80000000UL
/* CANFD_CH_M_TTCAN.TURNA */
#define CANFD_CH_M_TTCAN_TURNA_NAV_Pos          0UL
#define CANFD_CH_M_TTCAN_TURNA_NAV_Msk          0x3FFFFUL
/* CANFD_CH_M_TTCAN.TTLGT */
#define CANFD_CH_M_TTCAN_TTLGT_LT_Pos           0UL
#define CANFD_CH_M_TTCAN_TTLGT_LT_Msk           0xFFFFUL
#define CANFD_CH_M_TTCAN_TTLGT_GT_Pos           16UL
#define CANFD_CH_M_TTCAN_TTLGT_GT_Msk           0xFFFF0000UL
/* CANFD_CH_M_TTCAN.TTCTC */
#define CANFD_CH_M_TTCAN_TTCTC_CT_Pos           0UL
#define CANFD_CH_M_TTCAN_TTCTC_CT_Msk           0xFFFFUL
#define CANFD_CH_M_TTCAN_TTCTC_CC_Pos           16UL
#define CANFD_CH_M_TTCAN_TTCTC_CC_Msk           0x3F0000UL
/* CANFD_CH_M_TTCAN.TTCPT */
#define CANFD_CH_M_TTCAN_TTCPT_CCV_Pos          0UL
#define CANFD_CH_M_TTCAN_TTCPT_CCV_Msk          0x3FUL
#define CANFD_CH_M_TTCAN_TTCPT_SWV_Pos          16UL
#define CANFD_CH_M_TTCAN_TTCPT_SWV_Msk          0xFFFF0000UL
/* CANFD_CH_M_TTCAN.TTCSM */
#define CANFD_CH_M_TTCAN_TTCSM_CSM_Pos          0UL
#define CANFD_CH_M_TTCAN_TTCSM_CSM_Msk          0xFFFFUL


